In [1]:
from sqlalchemy import create_engine
import pandas as pd

#### Crear el "engine" pasando la direcci√≥n de la db

In [6]:
create_engine?

In [2]:
engine = create_engine('postgresql://celia@localhost:5432/mytestdb')
engine

Engine(postgresql://celia@localhost:5432/mytestdb)

#### Hacer la query especificando el "engine" que se desea usar

In [3]:
df = pd.read_sql_query('select * from "Customer"',con=engine)
df

   CustomerCode    Birthday Gender
0             1  2000-10-10      F
1             2  2015-01-12      M
2             3  2014-01-10      F
3             4  2011-01-10      F

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4 entries, 0 to 3
Data columns (total 3 columns):
CustomerCode    4 non-null int64
Birthday        4 non-null object
Gender          4 non-null object
dtypes: int64(1), object(2)
memory usage: 128.0+ bytes

In [5]:
df.describe()

       CustomerCode
count      4.000000
mean       2.500000
std        1.290994
min        1.000000
25%        1.750000
50%        2.500000
75%        3.250000
max        4.000000

In [7]:
df

   CustomerCode    Birthday Gender
0             1  2000-10-10      F
1             2  2015-01-12      M
2             3  2014-01-10      F
3             4  2011-01-10      F

Link a [Pandas NB](Starting%20with%20pandas.ipynb) para ver join, merge, append, etc

#### Agregando un nuevo registro a nuestra tabla "Customer" con pandas

In [25]:
new_df = pd.DataFrame([[4, pd.datetime(2011, 1, 10), 'F']], columns=df.columns)
new_df

   CustomerCode   Birthday Gender
0             4 2011-01-10      F

In [26]:
new_df.to_sql('Customer', engine, if_exists='append', index=None)

#### Agregando una nueva tabla a nuestra db desde pandas

In [29]:
new_table = pd.DataFrame([], columns=['WineCode', 'Type', 'Vintage'])
new_table

Empty DataFrame
Columns: [WineCode, Type, Vintage]
Index: []

In [30]:
new_table.to_sql('Wine', engine, index=None)

#### Ahora hagamos lo mismo con sqlalchemy

In [40]:
from sqlalchemy import MetaData, types
from sqlalchemy import Table, Column

In [35]:
metadata = MetaData()

In [41]:
time = Table('Time', metadata,
    Column('TimeCode', types.Integer, primary_key=True),
    Column('Date', types.DateTime, nullable=False),
 )

In [42]:
metadata.create_all(engine)

### Agregando elementos a Wine con pandas

In [10]:
data = [[1, 'White', 2000],
        [2, 'red', 2015],
        [3, 'rose', 2014]]

In [11]:
new_df = pd.DataFrame(data, columns=df_wine.columns)

In [12]:
new_df.to_sql('Wine', engine, if_exists='append', index=None)

In [13]:
df_wine = pd.read_sql_query('select * from "Wine"',con=engine)
df_wine

  WineCode   Type Vintage
0        1  White    2000
1        2    red    2015
2        3   rose    2014